wsse-to-basic-auth-transformation-policy/src/test/resources/admission_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"  >
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1"><wsse:UsernameToken wsu:Id="UsernameToken-7"><wsse:Username>joe</wsse:Username><wsse:Password Type="wsse:PasswordText">secret</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">7AmwOhaFs9FJksXCVraaQw==</wsse:Nonce><wsu:Created>2016-01-14T11:52:06.385Z</wsu:Created></wsse:UsernameToken></wsse:Security></soapenv:Header>
   <soapenv:Body>
      <ns:admitSubject xmlns:ns="http://www.mule-health.com/SOA/message/1.0" xmlns:ns1="http://www.mule-health.com/SOA/model/1.0">
         <ns1:Referer >
            <clientId>1234</clientId>
         </ns1:Referer>
         <ns1:Referral>
            <procedure>
               <code>In-patient</code>
               <admission>Elective</admission>
               <department>Cardiology</department>
            </procedure>
         </ns1:Referral>
         <ns1:Subject>
            <nationalId>1234</nationalId>
            <firstName>Nial</firstName>
            <lastName>Darbey</lastName>
            <address1>Buenos Aires</address1>
            <address2></address2>        
            <address3></address3>    
            <nationality>Irish</nationality>
            <gender>Male</gender>
            <dateOfBirth>1970-08-07</dateOfBirth>
         </ns1:Subject>
      </ns:admitSubject>
   </soapenv:Body>
</soapenv:Envelope>